[
  {
    "id": "1",
    "name": "Fundación",
    "author": "Isaac Asimov",
    "price": 8500,
    "category": "ciencia-ficcion",
    "description": "Clásico de Isaac Asimov sobre la caída de un imperio galáctico.",
    "longDescription": "En el año 12.067 de la Era Galáctica, el psicohistoriador Hari Seldon predice la inevitable caída del Imperio Galáctico tras 12.000 años de dominio. Para reducir el período de barbarie subsiguiente de 30.000 a solo 1.000 años, Seldon establece dos Fundaciones en extremos opuestos de la galaxia. La primera, en Terminus, se dedica a preservar el conocimiento científico mientras el Imperio se desmorona. A lo largo de la novela, seguimos cómo esta Fundación supera sucesivas crisis a través de la ciencia, el comercio y la religión, todo según el 'Plan Seldon' predicho décadas atrás.",
    "imageUrl": "https://i.ibb.co/ccHxZdgJ/fundacion.jpg",
    "stock": 15,
    "onSale": false,
    "originalPrice": null,
    "pages": 255,
    "publisher": "Ediciones B",
    "year": 1951,
    "language": "Español",
    "isbn": "978-8497593804"
  },
  {
    "id": "2",
    "name": "Dune",
    "author": "Frank Herbert",
    "price": 9200,
    "category": "ciencia-ficcion",
    "description": "Épica saga en el desértico planeta Arrakis por Frank Herbert.",
    "longDescription": "Arrakis, también conocido como Dune, es el planeta desértico más importante del universo por ser la única fuente de la especia melange, una droga que prolonga la vida, permite la navegación interestelar y desbloquea habilidades mentales. La Casa Atreides recibe el feudo de Arrakis, pero cae en una trampa mortal tendida por los Harkonnen. Paul Atreides, el joven heredero, y su madre Jessica escapan al desierto donde se unen a los Fremen, los habitantes nativos. Paul se convierte en Muad'Dib, el mesías que los Fremen esperaban, y lidera la rebelión que cambiará el destino del universo.",
    "imageUrl": "https://i.ibb.co/GQS5YFVb/dune.jpg",
    "stock": 8,
    "onSale": true,
    "originalPrice": 11500,
    "pages": 412,
    "publisher": "Nova",
    "year": 1965,
    "language": "Español",
    "isbn": "978-8497598724"
  },
  {
    "id": "3",
    "name": "Neuromante",
    "author": "William Gibson",
    "price": 7800,
    "category": "cyberpunk",
    "description": "Obra fundacional del cyberpunk por William Gibson.",
    "longDescription": "Case era un 'console cowboy', el mejor hacker en el ciberespacio, hasta que sus ex empleadores lo traicionaron dañando su sistema nervioso para siempre. Ahora vive al margen en el distrito rojo de Chiba City, Japón, cuando una misteriosa ex-marine llamada Molly lo rescata y le ofrece una cura a su condición. El precio: un último trabajo para el misterioso Armitage. Case deberá infiltrarse en la corporación Tessier-Ashpool para robar un increíblemente valioso programa de IA, mientras descubre que está atrapado en una compleja red de traiciones corporativas y juegos de poder que podrían costarle la vida.",
    "imageUrl": "https://i.ibb.co/r9Xx2ns/neuromante.jpg",
    "stock": 12,
    "onSale": false,
    "originalPrice": null,
    "pages": 320,
    "publisher": "Minotauro",
    "year": 1984,
    "language": "Español",
    "isbn": "978-8445074512"
  },
  {
    "id": "4",
    "name": "El juego de Ender",
    "author": "Orson Scott Card",
    "price": 8100,
    "category": "ciencia-ficcion",
    "description": "Estrategia militar interestelar por Orson Scott Card.",
    "longDescription": "La humanidad se encuentra al borde de la extinción tras dos invasiones de los 'insectores', una especie alienígena insectoide. Para prepararse para la tercera invasión, la Flota Internacional establece una escuela de batalla en el espacio donde niños superdotados son entrenados en el arte de la guerra. Andrew 'Ender' Wiggin, de 6 años, es seleccionado por su combinación única de compasión y genio táctico. En la Escuela de Batalla, Ender enfrenta aislamiento, envidia y juegos de guerra cada vez más complejos, sin saber que está siendo preparado para una batalla real que determinará el futuro de la humanidad.",
    "imageUrl": "https://i.ibb.co/mrFRLx4w/ender-game.jpg",
    "stock": 0,
    "onSale": false,
    "originalPrice": null,
    "pages": 384,
    "publisher": "Ediciones B",
    "year": 1985,
    "language": "Español",
    "isbn": "978-8466308093"
  },
  {
    "id": "5",
    "name": "Guía del autoestopista galáctico",
    "author": "Douglas Adams",
    "price": 7500,
    "category": "ciencia-ficcion-humor",
    "description": "Comedia sci-fi absurda por Douglas Adams.",
    "longDescription": "Un jueves cualquiera, Arthur Dent descubre que su casa en Inglaterra será demolida para construir una autopista. Minutos después, su amigo Ford Prefect (que resulta ser un alienígena) le informa que la Tierra será destruida para construir una autopista hiperespacial. Así comienza el increíble viaje de Arthur a través de la galaxia, acompañado de Ford, el deprimido robot Marvin, el presidente galáctico Zaphod Beeblebrox y la terrestre Trillian. Con la ayuda de la 'Guía del autoestopista galáctico', este peculiar grupo buscará la respuesta a la pregunta fundamental sobre la vida, el universo y todo lo demás.",
    "imageUrl": "https://i.ibb.co/9m0GDJc3/guia-autoestopista.jpg",
    "stock": 20,
    "onSale": true,
    "originalPrice": 8900,
    "pages": 216,
    "publisher": "Anagrama",
    "year": 1979,
    "language": "Español",
    "isbn": "978-8433920426"
  },
  {
    "id": "6",
    "name": "Solaris",
    "author": "Stanisław Lem",
    "price": 6900,
    "category": "ciencia-ficcion-filosofica",
    "description": "Reflexión sobre la conciencia y el amor por Stanisław Lem.",
    "longDescription": "El psicólogo Kris Kelvin llega a la estación espacial que orbita el planeta Solaris, un mundo cubierto completamente por un océano vivo que parece ser una inteligencia consciente. La estación está en caos y los pocos científicos restantes muestran comportamientos extraños. Pronto Kelvin descubre por qué: Solaris tiene la capacidad de materializar los recuerdos y traumas más profundos de los humanos. Para Kelvin, esto significa el regreso de su difunta esposa Harey, quien se suicidó años atrás. La novela explora los límites del conocimiento humano, la naturaleza de la conciencia y la imposibilidad de comprender verdaderamente algo completamente alienígena.",
    "imageUrl": "https://i.ibb.co/MDk991pF/solaris.jpg",
    "stock": 5,
    "onSale": false,
    "originalPrice": null,
    "pages": 280,
    "publisher": "Impedimenta",
    "year": 1961,
    "language": "Español",
    "isbn": "978-8417430960"
  },
  {
    "id": "7",
    "name": "¿Sueñan los androides con ovejas eléctricas?",
    "author": "Philip K. Dick",
    "price": 8300,
    "category": "ciencia-ficcion",
    "description": "Novela que inspiró Blade Runner, por Philip K. Dick.",
    "longDescription": "En un futuro post-apocalíptico de 1992 (desde la perspectiva de 1968), la Tierra está devastada por la Guerra Mundial Terminus. La mayoría de la humanidad ha emigrado a colonias marcianas, y aquellos que se quedan deben lidiar con la radiación y la extinción masiva de animales. Rick Deckard es un cazador de recompensas cuya misión es 'retirar' a seis androides Nexus-6 que han escapado de Marte. Mientras Deckard persigue a estos androides indistinguibles de humanos, comienza a cuestionar su propia humanidad y la naturaleza de la empatía, especialmente cuando se encuentra con la enigmática Rachael y descubre que los androides pueden desarrollar emociones genuinas.",
    "imageUrl": "https://i.ibb.co/RGRnccsZ/androides-ovejas.jpg",
    "stock": 18,
    "onSale": true,
    "originalPrice": 9500,
    "pages": 210,
    "publisher": "Minotauro",
    "year": 1968,
    "language": "Español",
    "isbn": "978-8445071849"
  },
  {
    "id": "8",
    "name": "La mano izquierda de la oscuridad",
    "author": "Ursula K. Le Guin",
    "price": 7900,
    "category": "ciencia-ficcion",
    "description": "Exploración de género y sociedad por Ursula K. Le Guin.",
    "longDescription": "Genly Ai es un enviado del Ekumen (una liga de mundos) al planeta Invierno (Gethen), un mundo congelado cuyos habitantes son andróginos. Los gethenianos son sexualmente latentes la mayor parte del tiempo, y solo durante el 'kemmer' desarrollan características sexuales masculinas o femeninas temporalmente. Ai debe convencer a las naciones gethenianas de unirse al Ekumen, pero se encuentra con que no comprende su cultura, política ni psicología. La novela sigue su difícil relación con Estraven, el primer ministro destituido de Karhide, mientras viajan a través del gélido paisaje y Ai aprende que para entender a los otros, primero debe cuestionar sus propias suposiciones sobre género, lealtad y humanidad.",
    "imageUrl": "https://i.ibb.co/1tVkWQfN/mano-izquierda-oscuridad.jpg",
    "stock": 7,
    "onSale": false,
    "originalPrice": null,
    "pages": 304,
    "publisher": "Minotauro",
    "year": 1969,
    "language": "Español",
    "isbn": "978-8445001174"
  },
  {
    "id": "9",
    "name": "Hyperion",
    "author": "Dan Simmons",
    "price": 8900,
    "category": "space-opera",
    "description": "Space opera épica inspirada en los Cuentos de Canterbury.",
    "longDescription": "Siete peregrinos se embarcan en un viaje final hacia el planeta Hyperion para encontrarse con el Alcaudón, una criatura temible que vive en las Tumbas del Tiempo y que puede manipular el tiempo. Cada peregrino tiene su propia razón para arriesgar la vida en este viaje, y durante el trayecto comparten sus historias al estilo de los Cuentos de Canterbury. Desde el cónsul que traicionó a la Hegemonía Humana, hasta el sacerdote cuyo contacto con los cruciformes lo transformó, el soldado que conoció el amor en medio de la guerra, el académico obsesionado con su hija, el detective contratado por un cyborg, el poeta maldito y el templario que busca redención. Sus destinos están entrelazados con el misterioso Alcaudón y la inminente guerra interestelar.",
    "imageUrl": "https://i.ibb.co/Z1GrH60P/hyperion.jpg",
    "stock": 14,
    "onSale": false,
    "originalPrice": null,
    "pages": 482,
    "publisher": "Ediciones B",
    "year": 1989,
    "language": "Español",
    "isbn": "978-8466633592"
  },
  {
    "id": "10",
    "name": "Ready Player One",
    "author": "Ernest Cline",
    "price": 7200,
    "category": "ciencia-ficcion",
    "description": "Aventura en un mundo virtual lleno de referencias ochenteras.",
    "longDescription": "En el año 2045, la Tierra está al borde del colapso y la mayoría de la humanidad escapa de la miserable realidad en el OASIS, un universo virtual masivo. Cuando el creador del OASIS, James Halliday, muere, deja su fortuna y el control del OASIS a quien pueda encontrar un 'huevo de pascua' digital escondido en el juego. Wade Watts, un adolescente pobre que vive en los suburbios de Oklahoma City, se convierte en el primer 'gunter' (cazador de huevos) en descifrar la primera pista. Pero pronto se encuentra compitiendo contra la poderosa corporación IOI, que quiere controlar el OASIS para explotarlo comercialmente. La búsqueda se convierte en una carrera contra el tiempo llena de referencias a la cultura pop de los 80.",
    "imageUrl": "https://i.ibb.co/hRddKWMY/ready-player-one.jpg",
    "stock": 0,
    "onSale": true,
    "originalPrice": 8500,
    "pages": 374,
    "publisher": "Salamandra",
    "year": 2011,
    "language": "Español",
    "isbn": "978-8498383944"
  },
  {
    "id": "11",
    "name": "Snow Crash",
    "author": "Neal Stephenson",
    "price": 7700,
    "category": "cyberpunk",
    "description": "Hiro Protagonist combate un virus informático en el metaverso.",
    "longDescription": "En un futuro distópico donde Estados Unidos se ha fragmentado en franquicias corporativas y el gobierno federal es casi irrelevante, Hiro Protagonista es un repartidor de pizza para la mafia y un brillante hacker en el Metaverso. Cuando un misterioso virus informático llamado 'Snow Crash' comienza a infectar a los hackers en el Metaverso y a causar daño cerebral en el mundo real, Hiro se une a Y.T., una joven repartidora de skate, para investigar. Su búsqueda los lleva a enfrentarse con L. Bob Rife, un magnate de los medios que pretende usar el Snow Crash -una droga y virus basado en antiguos mitos sumerios- para controlar las mentes humanas y dominar el mundo.",
    "imageUrl": "https://i.ibb.co/bMzyJwz7/snow-crash.jpg",
    "stock": 9,
    "onSale": false,
    "originalPrice": null,
    "pages": 440,
    "publisher": "Gigamesh",
    "year": 1992,
    "language": "Español",
    "isbn": "978-8496623866"
  },
  {
    "id": "12",
    "name": "La guerra interminable",
    "author": "Joe Haldeman",
    "price": 7100,
    "category": "militar",
    "description": "Relato de guerra interestelar con efectos de la relatividad.",
    "longDescription": "William Mandella es reclutado para combatir en una guerra interestelar contra los 'Tauranos'. Debido a los viajes a velocidad relativista, cada misión de combate de unos meses subjetivos significa que regresan a una Tierra donde han pasado décadas o siglos. Mandella sobrevive batalla tras batalla, pero cada regreso lo enfrenta a una sociedad que se ha transformado más allá del reconocimiento. La Tierra que conoció desaparece, reemplazada por culturas extrañas y deshumanizantes. La novela sigue su lucha por mantener su humanidad mientras se pregunta si la guerra contra un enemigo que nunca comprende realmente vale la pena, o si toda guerra es esencialmente interminable.",
    "imageUrl": "https://i.ibb.co/8D3KdJfq/guerra-interminable.jpg",
    "stock": 11,
    "onSale": false,
    "originalPrice": null,
    "pages": 278,
    "publisher": "La Factoría de Ideas",
    "year": 1974,
    "language": "Español",
    "isbn": "978-8498001455"
  },
  {
    "id": "13",
    "name": "El hombre en el castillo",
    "author": "Philip K. Dick",
    "price": 6800,
    "category": "historia-alternativa",
    "description": "Universo donde los aliados perdieron la Segunda Guerra Mundial.",
    "longDescription": "En una realidad alternativa donde las potencias del Eje ganaron la Segunda Guerra Mundial, Estados Unidos está dividido: la Costa Este está bajo control nazi, la Costa Oeste bajo dominio japonés, y las Montañas Rocosas forman una zona neutral precaria. A través de múltiples personajes -desde un fabricante de armas judío que oculta su identidad, hasta un experto en cultura americana que trabaja para los japoneses, y la autora de un libro prohibido que imagina un mundo donde los Aliados ganaron- Dick explora temas de realidad, identidad y libre albedrío. La novela cuestiona la naturaleza de la realidad misma a través del misterioso I Ching, que muchos personajes consultan para tomar decisiones importantes.",
    "imageUrl": "https://i.ibb.co/DHY4zX84/hombre-castillo.jpg",
    "stock": 6,
    "onSale": true,
    "originalPrice": 7800,
    "pages": 249,
    "publisher": "Minotauro",
    "year": 1962,
    "language": "Español",
    "isbn": "978-8445077247"
  },
  {
    "id": "14",
    "name": "Los desposeídos",
    "author": "Ursula K. Le Guin",
    "price": 7400,
    "category": "ciencia-ficcion-social",
    "description": "Análisis de dos sistemas políticos opuestos en mundos gemelos.",
    "longDescription": "Shevek es un brillante físico de Anarres, un mundo árido habitado por anarquistas que abandonaron el planeta gemelo Urras hace 200 años. Frustrado por el estancamiento intelectual en su sociedad igualitaria pero empobrecida, decide viajar a Urras, un mundo de abundancia material pero con profundas desigualdades sociales. La novela alterna entre su vida en Anarres -donde su genio es visto con sospecha- y su experiencia en Urras -donde es celebrado pero también manipulado por intereses políticos. Shevek busca completar su Teoría del Tiempo Simultáneo que permitiría la comunicación instantánea interestelar, mientras reflexiona sobre los fracasos y éxitos de ambos sistemas sociales y busca un camino hacia la verdadera libertad.",
    "imageUrl": "https://i.ibb.co/6RYD1HLF/desposeidos.jpg",
    "stock": 16,
    "onSale": false,
    "originalPrice": null,
    "pages": 352,
    "publisher": "Minotauro",
    "year": 1974,
    "language": "Español",
    "isbn": "978-8445071184"
  },
  {
    "id": "15",
    "name": "Altered Carbon",
    "author": "Richard K. Morgan",
    "price": 8200,
    "category": "cyberpunk",
    "description": "Investigan un suicidio en un mundo donde las conciencias se transfieren.",
    "longDescription": "En el siglo XXV, la humanidad ha conquistado la inmortalidad mediante el almacenamiento de la conciencia en 'pilas' corticales implantadas en la columna vertebral. Los cuerpos ('fundas') son intercambiables, y los ricos ('Meths', por metuselah) pueden respaldar su conciencia regularmente y vivir durante siglos. Takeshi Kovacs, un ex-soldado de élite ahora encarcelado, es 're-sleeved' en una nueva funda por el poderoso Laurens Bancroft, quien cree que fue asesinado aunque todas las evidencias apuntan a suicidio. Kovacs debe investigar el 'suicidio' de Bancroft en la vibrante y corrupta Bay City (antiguo San Francisco), descubriendo una conspiración que involucra a la élite inmortal, mientras lidia con los traumas de sus vidas pasadas.",
    "imageUrl": "https://i.ibb.co/20krCqts/altered-carbon.jpg",
    "stock": 3,
    "onSale": true,
    "originalPrice": 9900,
    "pages": 464,
    "publisher": "Gigamesh",
    "year": 2002,
    "language": "Español",
    "isbn": "978-8496623873"
  }
]